{"basics":{"name":"Doan Y Nhat","label":"Game Producer - Project Manager","picture":"/assets/img/avatar.jpg","email":"doanynhat.ftu@gmail.com","phone":"(+84) 813355788","website":"https://ynhatdoan.github.io","summary":"- As a producer, I take care of all aspects of a full product development cycle, from creative concept to app-store release. With solid understanding of Agile, LEAN and continuous development, I am always eager to apply tools and techniques to overcome obstacles at work. My mission is to ensure everyone in the team understands the product goals and backlog priority. My vision is being a better producer everyday.<br>\n- In the past, I was an experienced outsourcing project manager with a proven track of record of collaboration with leading studios such as Sony, EA, Wargaming, Respawn Entertainment and Epic Games, which require adherence to strict timelines and quality assurance standards.<br>\n- My life motto are being kind, listening, inspiring and developing people.<br>\n","location":{"address":"","postalCode":"","city":"Ho Chi Minh","countryCode":"VN","region":""},"profiles":[{"network":"LinkedIn","username":"Nhat Doan","url":"https://www.linkedin.com/in/doan-nhat-14329442/"}]},"work":[{"company":"Bootloader","position":"Producer","website":"https://bootloader.studio","startDate":"2024-11-01","endDate":"","summary":"Bootloader is a pioneering startup focused on enhancing digital lives through emotionally engaging digital companions. <br> Leveraging cutting-edge technologies like the Apple Vision Pro and advanced AI, we aim to establish a new category of interactive digital experiences that foster genuine connections.\n","highlights":["Oversee and coordinate all aspects of product development from design team to engineering, animation & art production.","Ensure the project stays on track & aligns with company's strategic goals.","Act as a bridge between different departments and stakeholders.","Organize All-Hands meetings to share visions & actionable plans with CEO & senior levels."]},{"company":"Bootloader","position":"Project Manager Lead","website":"https://bootloader.studio","startDate":"2024-11-01","endDate":"","summary":"","highlights":["Extended the role to include PM lead responsibilities while maintaining all PM duties","Collaborated with senior executives in product design meetings to align team efforts toward common objectives.","Facilitated planning meetings with all teams to clarify expected outcomes from the CEO and ensure effective execution of work.","Provided weekly progress and risk management reports to the CEO to monitor production status.","Organize triage meetings to discuss and prioritize product feedback before distributing work backlog to functional teams."]},{"company":"Bootloader","position":"Project Manager / Program Management Office","website":"https://bootloader.studio","startDate":"2023-11-01","endDate":"2024-05-01","summary":"","highlights":["Build the Product Roadmap and Production timeline.","Act as a communication bridge between team leaders and senior executives.","Provide input and output from senior levels in cross-team planning.","Align sprint goals across teams to meet targets.","Ensure proper execution of sprint planning and review meetings.","Resolve misalignments and miscommunication issues in production.","Keep Product Confluence pages updated."]},{"company":"ZaloPay","position":"Project Manager (Agile PMO)","website":"https://zalopay.vn","startDate":"2023-01-01","endDate":"2023-11-01","summary":"ZaloPay, the financial services arm of the internet firm VNG, operates as a standalone mobile payment app and has tied up with Visa, Mastercard, and 39 domestic banks. ZaloPay is also an integrated payment feature in the Zalo messaging app. This is the latest development in the competitive landscape of e-wallets.\n","highlights":["Create and manage release plan for multiple engineering teams. Ensure it is integrated to the wider portfolio end-to-end release plan.","Manage risks, issues, dependencies and continuous improvement actions for squads under your working areas.","Provide status reports regarding milestone, deliverables, RAID (Risk, Assumption, Issues, Dependencies), and communicating across stakeholders.","Manage the team capacity and advise roadmap, timelines to Product Owner and other Business Stakeholders.","Ability to create and maintain relationships with wide range of stakeholders (Product Owner, Business Owners, Technical Heads).","Communicated effectively across all levels of the organization."]},{"company":"Geotech","position":"Project Manager","website":"https://www.geotech.one","startDate":"2022-01-01","endDate":"2023-01-01","summary":"GeoTech is a Tech-company that develops integration tools for new technologies and gaming platforms for Unreal Engine.\n","highlights":["As a project manager in GeoTech, I works closely with project teams and clients to transfer goals into actionable plans, identify bottlenecks before they happen and tasks delivered in time frame manner. It is important to be an effective process owner for the team and act as a primary communication point between teams as needed.","Overview all project timelines to make sure the company maximizes its resource allocation.","Communicate with Epic Games to ensure we understand the requirements for resource demand and allocate the right people for Epic projects.","Handle partnership workflows with Epic to maintain a sustainable relationship with them.","Change management and risk management."]},{"company":"Glass Egg Digital Media","position":"Producer / Project Manager","website":"https://glassegg.com","startDate":"2018-01-01","endDate":"2020-01-01","summary":"Glass Egg - A Virtuos Studio is a 2D/3D art outsourcing studio and a game developer/publisher in the game industry.\n","highlights":["Be in charged with several well-known clients such as Sony, EA, Respawn US studio and involved into many titles: Real Racing, Spider-Man PS4, Medal of Honor, etc...","Be responsible for all project phases, from planning to monitoring and closing the project.","Handle communication between the project team members and stakeholders.","Develop and keep team focusing on risk management to ensure the risk responses in place."]},{"company":"Arcon-Sunmark Production Ltd","position":"Executive assistant to GD / Project coordinator","startDate":"2017-01-01","endDate":"2018-01-01","summary":"Arcon-Sunmark focuses on production and installation of large-scale solar thermal systems for the district heating plantand process heating.\n","highlights":["Coordinate different functional departments to execute the cross projects and report the progress to General Director.","Be in charged and coordinate all continuous improvement activities in the factory.","Support optimization project for production department."]}],"education":[{"institution":"Foreign Trade University","area":"External Economics","studyType":"Bachelor","startDate":"2011-01-01","endDate":"2014-01-01"}],"awards":[{"title":"JIRA fundementals Badge","date":"2023-01-01","awarder":"Atlassian"},{"title":"Writing Complex JQL Queries Badge","date":"2023-01-01","awarder":"Atlassian"},{"title":"Confluence fundementals Badge","date":"2023-01-01","awarder":"Atlassian"},{"title":"PMP certified active member","date":"2020-01-01","awarder":"Project Management Institute"},{"title":"Certified LEAN Professional Training","awarder":"Intel corporate"}],"skills":[{"name":"Project Management","level":"Master","keywords":["Scrum","Agile","Risk Management","Resource Management","Continuous Improvement","Program Management"]},{"name":"Office software","level":"Intermediate","keywords":["Word","Excel","Project"]},{"name":"Other tools","level":"Intermediate","keywords":["Shotgun","Trello","SVN","Perforce","Jira","Confluence"]}],"languages":[{"language":"Vietnamese","fluency":"Native speaker"},{"language":"English","fluency":"Full professional proficiency"}],"interests":[{"name":"Nature","keywords":["Tree","Forest"]},{"name":"Education","keywords":["Teaching","Social-Emotional Learning"]}]}
