{"basics":{"name":"Doan Y Nhat","label":"Project Manager","picture":"/assets/img/avatar.jpg","email":"doanynhat.ftu@gmail.com","phone":"(+84) 813355788","website":"https://ynhatdoan.github.io","summary":"Project manager with proven track record of working for some leading studios such as Sony, EA, War Gaming, Respawn Entertainment which have strict requirements in both time management and quality assurance.<br> Understanding how to help the team meet such high standards of requirement by quality control process, agile methodology and team collaboration.<br> Always practice PMP and Agile knowledge in the project.<br> Always pay attention to LEAN and Continuous Improvement tools to support the whole pipeline process.<br> Keen on listening, inspiring and developing people.<br>\n","location":{"address":"","postalCode":"","city":"Ho Chi Minh","countryCode":"VN","region":""},"profiles":[{"network":"LinkedIn","username":"Nhat Doan","url":"https://www.linkedin.com/in/doan-nhat-14329442/"}]},"work":[{"company":"Stylefit","position":"Production Manager","website":"https://stylefit.io/","startDate":"2021-01-01","endDate":"2022-01-01","summary":"StyleFit is a 3D furniture software company designed to help shoppers make faster and more informed purchasing decisions and improve retailers conversion rates all by enabling the shoppers to view furniture items in their own home through their mobile device. \n","highlights":["Handle all projects in production to satisfy the client's schedule and quality.","Create a master plan and roadmap for the production team, as well as handle Shotgun as daily progress tracking for all stakeholders.","Work with outsourcing team for extra resource if needed.","Troubleshoot any daily issues in production to make sure communications are clear and achievable."]},{"company":"Nam Trường Sơn - Kaspersky Education Foundation","position":"Program supervisor","website":"","startDate":"2019-01-01","endDate":"2020-01-01","summary":"Nam Trường Sơn - Kaspersky Education Foundation is an educational fund aiming to reinforce the development of quality education in Vietnam. <br> As the program supervisor, I work closely with the local non-profit organization to develop the project/programs that solve their current issues and empower the growth of young generation.\n","highlights":["Be a part of Development Board to develop annual strategy for the foundation.","Be on behalf of the sponsor to communicate with local NPO/ educational organization before approve/ decline their proposal and supervise the on-going projects/programs.","Analyse and evaluate the final results & reports before the project/program ends."]},{"company":"Glass Egg Digital Media","position":"Producer / Project Manager","website":"https://glassegg.com","startDate":"2018-01-01","endDate":"2020-01-01","summary":"Glass Egg - A Virtuos Studio is a 2D/3D art outsourcing studio and a game developer/publisher in the game industry.\n","highlights":["Be in charged with several well-known clients such as Sony, EA, Respawn US studio and involved into many titles: Real Racing, Spider-Man PS4, Medal of Honor, etc...","Be responsible for all project management tasks, from planning to managing and monitoring through begining to closing phases.","Develop and keep team focusing on risk management to ensure the risk responses in place."]},{"company":"Arcon-Sunmark Production Ltd","position":"Executive assistant to GD / Project coordinator","startDate":"2017-01-01","endDate":"2018-01-01","summary":"Arcon-Sunmark focuses on production and installation of large-scale solar thermal systems for the district heating plantand process heating.\n","highlights":["Coordinate the resources in multiple functional departments to execute the matrix projects and report to General Director.","Be in charged and coordinate all continuous improvement activitiesin the factory.","Propose and support the optimization plan for production process."]},{"company":"Transinex Pte. Ltd","position":"Program specialist","startDate":"2015-01-01","endDate":"2016-01-01","summary":"Singapore specialist in group travel since 1972. Specialise in inbound and outbound group travels for schools, corp as well as churches.\n","highlights":["Create travel itinerary for group/school/business tours from Singapore, Malaysia to Viet Nam.","Have on-the-job training in Singapore for operation management.","Become a tour manager during onsite tours to ensure every details are well-prepared."]}],"education":[{"institution":"Foreign Trade University","area":"External Economics","studyType":"Bachelor","startDate":"2011-01-01","endDate":"2014-01-01"}],"awards":[{"title":"PMP certified active member","date":"2020-01-01","awarder":"Project Management Institute"},{"title":"Certified LEAN Professional Training","awarder":"Intel corporate"}],"skills":[{"name":"Project Management","level":"Master","keywords":["Scrum","Agile","Risk Management","Resource Management"]},{"name":"Office software","level":"Intermediate","keywords":["Word","Excel","Project"]},{"name":"Other tools","level":"Intermediate","keywords":["Shotgun","Trello","SVN","Perforce"]}],"languages":[{"language":"Vietnamese","fluency":"Native speaker"},{"language":"English","fluency":"Full professional proficiency"}],"interests":[{"name":"Nature","keywords":["Tree","Forest"]},{"name":"Education","keywords":["Teaching","Social-Emotional Learning"]}]}
