{"basics":{"name":"Doan Y Nhat","label":"Project Manager","picture":"/assets/img/avatar.jpg","email":"doanynhat.ftu@gmail.com","phone":"(+84) 813355788","website":"https://ynhatdoan.github.io","summary":"- Project manager with proven track record of working for some leading studios such as Sony, EA, War Gaming, Respawn Entertainment, Epic Games which have strict requirements in both time management and quality assurance.<br>\n- Understand how to help the team meet high requirement by quality control, agile methodology and team collaboration.<br>\n- Keen on practicing PMP and Agile knowledge in the project.<br>\n- Keen on LEAN and Continuous Improvement tools for supporting production pipeline.<br>\n- Keen on listening, inspiring and developing people.<br>\n","location":{"address":"","postalCode":"","city":"Ho Chi Minh","countryCode":"VN","region":""},"profiles":[{"network":"LinkedIn","username":"Nhat Doan","url":"https://www.linkedin.com/in/doan-nhat-14329442/"}]},"work":[{"company":"Geotech","position":"Project Manager","website":"https://www.geotech.one","startDate":"2022-01-01","endDate":"Now","summary":"GeoTech is a Tech-company that develops integration tools for new technologies and gaming platforms for Unreal Engine.\n","highlights":["As a project manager in GeoTech, I will work closely with GeoTech team and Clients to transfer goals into actionable plans, identify bottlenecks before they happen and tasks delivered in time frame manner.  It is important to be an effective process owner for the team and act as a primary communication point between teams as needed."]},{"company":"Stylefit","position":"Production Manager","website":"https://stylefit.io/","startDate":"2021-01-01","endDate":"2022-01-01","summary":"StyleFit is a 3D furniture software company designed to help shoppers make faster and more informed purchasing decisions and improve retailers conversion rates all by enabling the shoppers to view furniture items in their own home through their mobile device. \n","highlights":["Handle all projects in production to satisfy client's schedule and quality.","Create master plan and roadmap for production team, as well as handle Shotgun as daily progress tracking for all stakeholders.","Work with outsourcing team for extra resource if needed.","Troubleshoot any daily issues in production to ensure communication lines are clear and achievable."]},{"company":"Nam Trường Sơn - Kaspersky Education Foundation","position":"Program supervisor","website":"","startDate":"2019-01-01","endDate":"2020-01-01","summary":"Nam Trường Sơn - Kaspersky Education Foundation is an educational fund aiming to reinforce the development of quality education in Vietnam. <br> As the program supervisor, I work closely with the local non-profit organization to develop the project/programs that solve their current issues and empower the growth of young generation.\n","highlights":["Be a part of Development Board to develop annual strategy for the foundation.","Be on behalf of the sponsor to communicate with local NPO/ educational organization before approving/ declining their proposal and supervising on-going projects/programs.","Analyse and evaluate the final results and reports before the project/program ends."]},{"company":"Glass Egg Digital Media","position":"Producer / Project Manager","website":"https://glassegg.com","startDate":"2018-01-01","endDate":"2020-01-01","summary":"Glass Egg - A Virtuos Studio is a 2D/3D art outsourcing studio and a game developer/publisher in the game industry.\n","highlights":["Be in charged with several well-known clients such as Sony, EA, Respawn US studio and involved into many titles: Real Racing, Spider-Man PS4, Medal of Honor, etc...","Be responsible for all project phases, from planning to monitoring and closing the project.","Develop and keep team focusing on risk management to ensure the risk responses in place."]},{"company":"Arcon-Sunmark Production Ltd","position":"Executive assistant to GD / Project coordinator","startDate":"2017-01-01","endDate":"2018-01-01","summary":"Arcon-Sunmark focuses on production and installation of large-scale solar thermal systems for the district heating plantand process heating.\n","highlights":["Coordinate different functional departments to execute the cross projects and report the progress to General Director.","Be in charged and coordinate all continuous improvement activities in the factory.","Support optimization project for production department."]},{"company":"Transinex Pte. Ltd","position":"Program specialist","startDate":"2015-01-01","endDate":"2016-01-01","summary":"Singapore specialist in group travel since 1972. Specialise in inbound and outbound group travels for schools, corp as well as churches.\n","highlights":["Create travel itinerary for group/school/business tours from Singapore, Malaysia to Viet Nam.","Have on-the-job training in Singapore for operation management.","Become a tour manager during onsite tours to ensure the trips are well-prepared."]}],"education":[{"institution":"Foreign Trade University","area":"External Economics","studyType":"Bachelor","startDate":"2011-01-01","endDate":"2014-01-01"}],"awards":[{"title":"PMP certified active member","date":"2020-01-01","awarder":"Project Management Institute"},{"title":"Certified LEAN Professional Training","awarder":"Intel corporate"}],"skills":[{"name":"Project Management","level":"Master","keywords":["Scrum","Agile","Risk Management","Resource Management"]},{"name":"Office software","level":"Intermediate","keywords":["Word","Excel","Project"]},{"name":"Other tools","level":"Intermediate","keywords":["Shotgun","Trello","SVN","Perforce","Jira","Confluence"]}],"languages":[{"language":"Vietnamese","fluency":"Native speaker"},{"language":"English","fluency":"Full professional proficiency"}],"interests":[{"name":"Nature","keywords":["Tree","Forest"]},{"name":"Education","keywords":["Teaching","Social-Emotional Learning"]}]}
